Repository: giellalt/corpus-sme
Catalog: prestable/tmx/eng/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=129_lang=davvi.html.tmx
Source language: sme
Languages: eng

source: Ságadoalli sáhkavuorut
eng: Presidents speeches

source: Juvvá Lemeha sáhka 15.10.2013, Norgga Sámediggi rahpandoalut
eng: Speech by Klemetti Näkkäläjärvi on side event in WG8J8, Montreal

source: Juvvá Lemeha sáhka 28.8.2013 Ruoŧa Sámediggi rahpan
eng: Klemetti Näkkäläjärvi ' s speech on Saami Language revitalization

source: Juvvá Lemeha sáhka Sámeparlamentarihkkáriidkonferánsas 10.11.2011
eng: Speech by Klemetti Näkkäläjärvi on Tales from the North- Conference

source: Juvvá Lemeha, Klemetti Näkkäläjärvi sáhka sámi álbmotbeaivve doaluin Anáris 6.2.2010
eng: Speech by Klemetti Näkkäläjärvi, Vulnerable Arctic Exhibition, Brussels

source: Klemetti Näkkäläjärvi sáhka 16.10.2009 nuoraid konfereanssas
eng: Klemetti Näkkäläjärvi ' s speech on Arctic Governance in SCPAR meeting

source: Klemetti Näkkäläjärvi sáhka dáiddačájáhusa rahpamii 11.6.2009
eng: Speech by Klemetti Näkkäläjärvi, Conference on Arctic Science, International Law and Climate Change

source: Klemetti Näkkäläjärvi sáhka Gollegiella-bálkkašumi geigendilálašvuođas 12.11.2008
eng: Speech by Klemetti Näkkäläjärvi on Rose-Roth 74 th seminar 19.6.2010

source: Klemetti Näkkäläjärvi sáhka Sámi Parlamentarihkáriid konferánsas 29.10.2008
eng: Saami People ´s right to self-determination in Finland K Näkkäläjärvi 150410

source: Klemetti Näkkäläjärvi rahpansáhka Arktalaš semináras Anaris 22.9.2008
eng: Opening statement by Klemetti Näkkäläjärvi 15.4.
